//------------------------------------------------------------------------------------------------------------
#include <GBAI_Library.h>
//------------------------------------------------------------------------------------------------------------




// UGBAI_Library
void UGBAI_Library::LogGBEvent(const FString &msg)
{
    // В Shipping билде этот макрос станет пустым местом, но сама функция вызовется (потратив 0.000001ms).
    UE_LOG(LogTemp, Log, TEXT("[GB_LOG]: %s"), *msg);
}
//------------------------------------------------------------------------------------------------------------
bool UGBAI_Library::IsActorValid(const AActor* ActorToCheck)
{
    if (!ActorToCheck)
        return false;

    return IsValid(ActorToCheck);
}
//------------------------------------------------------------------------------------------------------------
