//------------------------------------------------------------------------------------------------------------
#pragma once
//------------------------------------------------------------------------------------------------------------
#include <GameplayEffect.h>
#include "GBG_Gameplay_Effect.generated.h"
//------------------------------------------------------------------------------------------------------------
/**
 * Базовый класс для всех Gameplay Effects в проекте.
 * Позволяет задать общую логику или свойства в будущем.
 */
UCLASS() class GBGAMEPLAY_API UGBG_Gameplay_Effect : public UGameplayEffect
{
	GENERATED_BODY()

};
//------------------------------------------------------------------------------------------------------------
